Repository: AiursoftWeb/MarkToHtml
Catalog: src/Aiursoft.MarkToHtml/Resources/Views/Dashboard/Index.*.resx
Languages: ar_sa, ja_jp, th_th, zh_tw

source: &quot;Fire-and-forget&quot; support for long-running tasks (like emails or AI), featuring a GUI for queue management, parallel processing, and cancellation.
ja_jp: 長期実行タスク（メールやAIなど）に対する「ファイアアンドフォーゲット」サポート。キュー管理、並列処理、キャンセルに対応するGUIを備えています。
th_th: การสนับสนุนแบบ "Fire-and-forget" สำหรับงานที่ใช้เวลานาน (เช่น อีเมลหรือปัญญาประดิษฐ์) พร้อมอินเทอร์เฟซกราฟิกสำหรับการจัดการคิว การประมวลผลแบบขนาน และการยกเลิก
zh_tw: 「即發即忘」支援長時間執行的任務（例如電子郵件或人工智慧），並提供圖形化介面以進行佇列管理、平行處理及取消作業。

source: A built-in Role-Based Access Control (RBAC) system for fine-grained permission management.
ar_sa: نظام مدمج للتحكم بالوصول القائم على الأدوار (RBAC) لإدارة الصلاحيات بشكل دقيق.
ja_jp: 細粒度の権限管理向けの組み込み型ロールベースアクセス制御(RBAC)システム
th_th: ระบบควบคุมการเข้าถึงตามบทบาท (RBAC) แบบฝังในตัว สำหรับการจัดการสิทธิ์อย่างละเอียด
zh_tw: 內建的基於角色的存取控制 (RBAC) 系統，用於細粒度的權限管理。

source: A complete solution for user authentication and profile management right out of the box.
ar_sa: حل كامل لإدارة المصادقة للمستخدم وإدارة الملفات الشخصية جاهزًا للعمل مباشرة.
ja_jp: 出荷時から完全なユーザー認証およびプロフィール管理ソリューションが提供されます。
th_th: โซลูชันครบวงจรสำหรับการยืนยันตัวตนของผู้ใช้และการจัดการโปรไฟล์ทันทีที่เปิดใช้งาน
zh_tw: 開箱即用的完整使用者驗證與個人檔案管理解決方案。

source: A complete solution for user authentication and profile management.
ja_jp: ユーザー認証およびプロフィール管理の完全なソリューション
th_th: โซลูชันครบวงจรสำหรับการยืนยันตัวตนของผู้ใช้และการจัดการโปรไฟล์
zh_tw: 完整的使用者驗證與個人檔案管理解決方案

source: A fully responsive layout that looks great on both desktop and mobile devices.
ar_sa: تصميم متجاوب بالكامل يظهر بشكل ممتاز على كل من أجهزة الكمبيوتر المكتبية والأجهزة المحمولة.
ja_jp: デスクトップとモバイルデバイスの両方で美しい見た目を実現する完全に応答性のあるレイアウトです。
th_th: การออกแบบที่ปรับขนาดได้อย่างสมบูรณ์ ซึ่งดูดีทั้งบนเดสก์ท็อปและอุปกรณ์มือถือ
zh_tw: 一個完全響應式的版面，無論在桌面還是行動裝置上都能呈現出優美的外觀。

source: A modern, feature-rich, and highly extensible foundation for your next web application.
ar_sa: أساس حديث، غني بالميزات، وقابل للتوسيع بشكل كبير لتطبيق الويب التالي الخاص بك.
ja_jp: 次回のウェブアプリケーション用の現代的で機能豊富かつ高機能拡張性を持つ基盤です。
th_th: พื้นฐานที่ทันสมัย ครบครันด้วยคุณสมบัติ และสามารถขยายได้อย่างสูง สำหรับแอปพลิเคชันเว็บของคุณในครั้งต่อไป
zh_tw: 一個現代、功能豐富且高度可擴展的基礎架構，用於您下一個網路應用程式。

source: AI-Powered Translations
ar_sa: ترجمات مدعومة بالذكاء الاصطناعي
ja_jp: AI駆動翻訳
th_th: การแปลด้วยปัญญาประดิษฐ์
zh_tw: AI智慧翻譯

source: All dependencies are automatically registered and always available via constructor injection.
ar_sa: جميع الاعتماديات تُسجَّل تلقائيًا ومتاحة دائمًا عبر التزامن عبر المُنشئ.
ja_jp: すべての依存関係は自動的に登録され、コンストラクタインジェクション経由で常に利用可能になります。
th_th: การพึ่งพาทั้งหมดจะถูกลงทะเบียนโดยอัตโนมัติและพร้อมใช้งานตลอดเวลาผ่านการส่งผ่านคอนสตรัคเตอร์
zh_tw: 所有相依性都會自動註冊，並可透過建構子注入隨時取得。

source: Automatic Dark Mode
ar_sa: الوضع الداكن التلقائي
ja_jp: 自動ダークモード
th_th: โหมดมืดอัตโนมัติ
zh_tw: 自動深色模式

source: Automatic Dependency Injection
ar_sa: الإدخال التلقائي للاعتماد
ja_jp: 自動依存関係のインジェクション
th_th: การแทรกอัตโนมัติของความพึ่งพา
zh_tw: 自動相依性插入

source: Automatic Time Zone Handling
ja_jp: 自動タイムゾーン処理
th_th: การจัดการเขตเวลาอัตโนมัติ
zh_tw: 自動時區處理

source: Automatic, AI-driven translation into 28 languages for global reach.
ar_sa: ترجمة تلقائية مدعومة بالذكاء الاصطناعي إلى 28 لغة للوصول العالمي.
ja_jp: 28か国語への自動的AI駆動翻訳でグローバルな展開を実現
th_th: การแปลอัตโนมัติที่ขับเคลื่อนด้วยปัญญาประดิษฐ์ สำหรับ 28 ภาษา เพื่อการเข้าถึงทั่วโลก
zh_tw: 自動化、由人工智慧驅動的翻譯，支援 28 種語言，拓展全球影響力。

source: Automatic, AI-driven translation into 28 languages.
ja_jp: 28か国語への自動的、AI駆動型の翻訳。
th_th: การแปลอัตโนมัติ ด้วยปัญญาประดิษฐ์ ไปยังภาษา 28 ภาษา
zh_tw: 自動化、由AI驅動的28種語言翻譯。

source: Background Job Processing
ja_jp: バックグラウンドジョブ処理
th_th: การประมวลผลงานในพื้นหลัง
zh_tw: 背景工作處理

source: Built-in User Management
ar_sa: إدارة المستخدم المضمنة
ja_jp: 組み込みユーザー管理
th_th: การจัดการผู้ใช้แบบฝังใน
zh_tw: 內建使用者管理

source: Comes with Docker support for simplified and consistent deployments.
ja_jp: Dockerサポートを備えており、簡素化され、一貫したデプロイが可能になります。
th_th: มาพร้อมการรองรับ Docker สำหรับการจัดส่งที่ง่ายและสม่ำเสมอ
zh_tw: 內建 Docker 支援，讓部署更簡化且一致。

source: Comes with full Docker support for simplified, consistent, and reliable deployments.
ar_sa: يأتي مع دعم كامل لـ Docker لتسهيل النشر المتسق والموثوق.
ja_jp: 簡単で一貫性があり、信頼性の高いデプロイを実現するための完全なDockerサポートを備えています。
th_th: มาพร้อมการรองรับ Docker แบบเต็มรูปแบบเพื่อการปรับใช้งานที่ง่าย สม่ำเสมอ และเชื่อถือได้
zh_tw: 內建完整的 Docker 支援，讓部署更簡化、一致且可靠。

source: Comprehensive Documentation
ar_sa: توثيق شامل
ja_jp: 包括的なドキュメント
th_th: เอกสารประกอบอย่างละเอียด
zh_tw: 完整的文件

source: Consistency Validation
ja_jp: 整合性検証
th_th: การตรวจสอบความสอดคล้อง
zh_tw: 一致性驗證

source: Develop exclusively in UTC while the system automatically converts and displays dates in the user&apos;s local time zone.
ja_jp: UTCで専用に開発し、システムが自動的に日時をユーザーのローカルタイムゾーンに変換して表示します。
th_th: พัฒนาเฉพาะในเวลา UTC ขณะที่ระบบจะแปลงและแสดงวันที่อัตโนมัติเป็นเขตเวลาท้องถิ่นของผู้ใช้
zh_tw: 開發時僅使用 UTC，系統會自動將日期轉換並顯示為使用者所在時區的時間。

source: Dockerized for Deployment
ar_sa: مُضَعَّف بـ Docker للنشر
ja_jp: デプロイ用にDocker化されています
th_th: ใช้งานได้ทันทีด้วย Docker สำหรับการติดตั้ง
zh_tw: Docker 化以供部署

source: Dockerized for Easy Deployment
ja_jp: Docker対応でデプロイが簡単
th_th: ใช้ Docker สำหรับการติดตั้งที่ง่าย
zh_tw: Docker 化，輕鬆部署

source: Dynamic Navigation Bar
ar_sa: شريط التنقل الديناميكي
ja_jp: 動的ナビゲーションバー
th_th: แถบนำทางแบบไดนามิก
zh_tw: 動態導航列

source: Easily switch between database providers, including SQLite, MySQL, SQL Server, and an in-memory database for testing.
ja_jp: SQLite、MySQL、SQL Server、およびテスト用のインメモリデータベースを含む、データベースプロバイダ間を簡単に切り替えることができます。
th_th: เปลี่ยนผู้ให้บริการฐานข้อมูลได้อย่างง่ายดาย รวมถึง SQLite, MySQL, SQL Server และฐานข้อมูลในหน่วยความจำสำหรับการทดสอบ
zh_tw: 輕鬆切換資料庫提供者，包含 SQLite、MySQL、SQL Server，以及用於測試的記憶體資料庫。

source: Easily switch between providers like SQLite, MySQL, SQL Server, and an in-memory database for testing.
ar_sa: يمكنك بسهولة التبديل بين مزودي الخدمة مثل SQLite وMySQL وSQL Server وقاعدة بيانات في الذاكرة لاختبار البرامج.
ja_jp: SQLite、MySQL、SQL Server など、プロバイダー間を簡単に切り替えることができ、テスト用にメモリ内データベースも利用可能です。
th_th: สลับระหว่างผู้ให้บริการได้อย่างง่ายดาย เช่น SQLite, MySQL, SQL Server, และฐานข้อมูลในหน่วยความจำสำหรับการทดสอบ
zh_tw: 輕鬆切換至 SQLite、MySQL、SQL Server 等資料庫提供者，以及用於測試的記憶體資料庫。

source: Effortlessly write integration tests using in-memory databases, temporary file systems, built-in mocking, and real-world HTTP request simulation.
ja_jp: インメモリデータベース、一時ファイルシステム、組み込みモック、本格的なHTTPリクエストシミュレーションを使用して、簡単に統合テストを書くことができます。
th_th: เขียนการทดสอบการผสานรวมได้อย่างง่ายดาย โดยใช้ฐานข้อมูลในหน่วยความจำ ระบบไฟล์ชั่วคราว การจำลองแบบที่มีอยู่ในตัว และการจำลองการร้องขอ HTTP แบบจริงในโลกแห่งความเป็นจริง
zh_tw: 輕鬆撰寫整合測試，使用記憶體資料庫、暫時性檔案系統、內建模擬，以及真實世界的 HTTP 請求模擬。

source: Features a built-in file management system with automatic avatar compression and privacy protection.
ja_jp: 自動アバター圧縮とプライバシー保護を備えた組み込みファイル管理システムを搭載しています。
th_th: มีระบบจัดการไฟล์ภายในพร้อมการบีบอัดภาพประจำตัวอัตโนมัติและป้องกันความเป็นส่วนตัว
zh_tw: 具備內建的檔案管理系統，支援自動頭像壓縮與隱私保護。

source: Features a built-in file management system with automatic avatar compression.
ar_sa: يتميز بنظام إدارة ملفات مدمج مع ضغط تلقائي للصورة الرمزية.
ja_jp: 自動アバター圧縮機能付きの組み込みファイル管理システムを備えています。
th_th: มีระบบจัดการไฟล์แบบฝังในพร้อมการบีบอัดภาพโปรไฟล์อัตโนมัติ
zh_tw: 具備內建的檔案管理系統，並支援自動頭像壓縮。

source: Handle recurring jobs like cleanup and synchronization with a comprehensive GUI for monitoring execution history and logs.
ja_jp: クリーンアップや同期などの繰り返し実行ジョブを、実行履歴やログのモニタリングに使える包括的なGUIで管理します。
th_th: จัดการงานที่เกิดซ้ำ เช่น การทำความสะอาดและซิงค์ข้อมูล ด้วยอินเทอร์เฟซกราฟิกที่ครอบคลุม สำหรับติดตามประวัติการดำเนินการและบันทึกการใช้งาน
zh_tw: 處理如清理與同步等重複性工作，並透過完整的圖形介面監控執行歷程與記錄。

source: Hello World!
ar_sa: مرحبا بالعالم!
ja_jp: こんにちは世界！
th_th: สวัสดีโลก!
zh_tw: 你好世界！

source: Includes extensive documentation and practical examples to get you started quickly.
ar_sa: يشمل وثائق مفصلة وأمثلة عملية للبدء بسرعة.
ja_jp: 広範なドキュメントと実用的な例が含まれており、すぐに使い始められます。
th_th: มีเอกสารประกอบอย่างละเอียดและตัวอย่างการใช้งานจริงเพื่อช่วยให้คุณเริ่มต้นได้อย่างรวดเร็ว
zh_tw: 包含完整的文件說明與實用範例，讓您快速上手。

source: Integrated File Management
ar_sa: إدارة الملفات المتكاملة
ja_jp: 統合ファイル管理
th_th: การจัดการไฟล์แบบบูรณาการ
zh_tw: 整合式檔案管理

source: Models are validated on both client and server sides based on data annotations.
ja_jp: モデルは、データ注釈に基づいて、クライアント側およびサーバー側の両方で検証されます。
th_th: โมเดลจะได้รับการตรวจสอบความถูกต้องทั้งในด้านไคลเอ็นต์และเซิร์ฟเวอร์ตามการตั้งค่าข้อมูล
zh_tw: 模型會根據資料註解，在客戶端和伺服器端同時進行驗證。

source: Multiple Database Provider Support
ja_jp: 複数のデータベースプロバイダーサポート
th_th: การรองรับผู้ให้บริการฐานข้อมูลหลายตัว
zh_tw: 支援多資料庫提供者

source: Multiple Database Support
ar_sa: دعم قواعد البيانات المتعددة
ja_jp: 複数のデータベース対応
th_th: รองรับฐานข้อมูลหลายระบบ
zh_tw: 多資料庫支援

source: OpenID Connect Integration
ar_sa: تكامل OpenID Connect
ja_jp: OpenID Connect 統合
th_th: การผสานระบบ OpenID Connect
zh_tw: OpenID Connect 集成

source: RBAC Authorization
ar_sa: الصلاحيات بناءً على الأدوار
ja_jp: RBAC 認可
th_th: การยืนยันสิทธิ์ตามบทบาท (RBAC)
zh_tw: RBAC 權限管理

source: Read the document
ar_sa: اقرأ الوثيقة
ja_jp: ドキュメントを読む
th_th: อ่านเอกสาร
zh_tw: 閱讀文件

source: Responsive Design
ar_sa: تصميم متجاوب
ja_jp: 応答性のあるデザイン
th_th: การออกแบบที่ปรับตัวได้
zh_tw: 響應式設計

source: Robust Integration Testing
ja_jp: 堅牢な統合テスト
th_th: การทดสอบการผสานรวมที่มั่นคง
zh_tw: 強大的整合測試

source: Scheduled Task Management
ja_jp: スケジュールタスク管理
th_th: การจัดการงานที่กำหนดเวลา
zh_tw: 排程工作管理

source: Seamlessly integrate with any OpenID Connect provider, with automatic role synchronization.
ar_sa: تُدمج بسلاسة مع أي مزود OpenID Connect، مع مزامنة تلقائية للدور.
ja_jp: あらゆる OpenID Connect プロバイダーとシームレスに統合でき、ロールの自動同期が可能です。
th_th: ผสานเข้ากับผู้ให้บริการ OpenID Connect ใด ๆ ได้อย่างราบรื่น พร้อมการซิงค์บทบาทอัตโนมัติ
zh_tw: 輕鬆與任何 OpenID Connect 提供者整合，並自動同步角色。

source: Smart Configuration Overrides
ja_jp: スマート設定オーバーライド
th_th: การแทนที่การตั้งค่าอัจฉริยะ
zh_tw: 智慧型設定覆寫

source: Smart dark mode that adapts to the user&apos;s system settings.
ja_jp: ユーザーのシステム設定に合わせて自動的に調整されるスマートなダークモード。
th_th: โหมดมืดอัจฉริยะที่ปรับตัวตามการตั้งค่าระบบของผู้ใช้งาน
zh_tw: 智慧型深色模式，可根據使用者的系統設定自動調整。

source: Smart dark mode that automatically adapts to the user&apos;s system settings.
ar_sa: وضع داكن ذكي يتكيف تلقائيًا مع إعدادات النظام الخاصة بالمستخدم.
ja_jp: ユーザーのシステム設定に自動的に適応するスマートなダークモード。
th_th: โหมดมืดอัจฉริยะที่ปรับตัวอัตโนมัติให้เข้ากับการตั้งค่าระบบของผู้ใช้
zh_tw: 智慧型深色模式，可自動根據使用者的系統設定進行調整。

source: Start a new project
ar_sa: 시작 مشروع جديد
ja_jp: 新しいプロジェクトを開始する
th_th: เริ่มโปรเจกต์ใหม่
zh_tw: 開始新專案

source: Supports both environment variables and database-backed settings, with automatic priority given to environment variables for seamless overrides.
ja_jp: 環境変数とデータベースベースの設定の両方をサポートしており、環境変数に自動的に優先順位が与えられ、シームレスなオーバーライドが可能になります。
th_th: รองรับตัวแปรสภาพแวดล้อมและตั้งค่าที่เก็บในฐานข้อมูลทั้งสองแบบ โดยให้ความสำคัญอัตโนมัติแก่ตัวแปรสภาพแวดล้อมเพื่อการแทนที่ที่ราบรื่น
zh_tw: 支援環境變數與資料庫儲存設定，並自動優先使用環境變數以實現無縫覆蓋。

source: The navigation bar automatically adjusts based on user roles and permissions.
ar_sa: شريط التنقل يتم تكيّفه تلقائيًا وفقًا لدور المستخدم والصلاحيات.
ja_jp: ナビゲーションバーは、ユーザーのロールと権限に応じて自動的に調整されます。
th_th: แถบนำทางจะปรับตัวอัตโนมัติตามบทบาทและสิทธิ์ของผู้ใช้
zh_tw: 導覽列會根據使用者角色與權限自動調整。

source: This is a template project, where we start the voyager...
ar_sa: هذا مشروع نموذجي، حيث نبدأ رحلة الباحث...
ja_jp: これはテンプレートプロジェクトです。ここから探検家を始めます...
th_th: นี่คือโครงการต้นแบบ ซึ่งเราเริ่มต้นการเดินทางของนักเดินทาง...
zh_tw: 這是範本專案，我們將啟程探索者...

source: Welcome
ar_sa: مرحباً
ja_jp: ようこそ
th_th: ยินดีต้อนรับ
zh_tw: 歡迎

source: Why use the Aiursoft Template?
ar_sa: لماذا تستخدم قالب Aiursoft؟
ja_jp: Aiursoftテンプレートを使うのはなぜですか？
th_th: ทำไมต้องใช้เทมเพลต Aiursoft?
zh_tw: 為什麼要使用 Aiursoft 模板？
