Repository: AiursoftWeb/MarkToHtml
Catalog: src/Aiursoft.MarkToHtml/Resources/Views/Mermaid/Index.*.resx
Languages: da_dk, de_de, el_gr, es_es, fr_fr, hi_in, it_it, ko_kr, pt_pt, ro_ro, ru_ru, th_th, tr_tr, zh_cn, zh_hk

source: Diagram Title (optional)
da_dk: Diagramtitel (valgfri)
de_de: Diagrammtitel (optional)
el_gr: Τίτλος Διαγράμματος (προαιρετικό)
es_es: Título del diagrama (opcional)
fr_fr: Titre du diagramme (facultatif)
hi_in: आरेख शीर्षक (वैकल्पिक)
it_it: Titolo del diagramma (opzionale)
ko_kr: 다이어그램 제목 (선택 사항)
pt_pt: Título do Diagrama (opcional)
ro_ro: Titlul diagramei (opțional)
ru_ru: Название диаграммы (необязательно)
th_th: ชื่อไดอะแกรม (ไม่บังคับ)
tr_tr: Diyagram Başlığı (isteğe bağlı)
zh_cn: 图表标题（可选）
zh_hk: 圖表標題（可選）

source: Mermaid Input
de_de: Mermaid-Eingabe
el_gr: Είσοδος Mermaid
es_es: Entrada de Mermaid
fr_fr: Entrée Mermaid
hi_in: मरमेड इनपुट
it_it: Input Mermaid
ko_kr: 머메이드 입력
pt_pt: Entrada Mermaid
ro_ro: Intrare Mermaid
ru_ru: Ввод Mermaid
th_th: อินพุต Mermaid
tr_tr: Mermaid Girişi
zh_cn: Mermaid 输入
zh_hk: 美人魚輸入

source: Preview
da_dk: Forhåndsvisning
de_de: Vorschau
el_gr: Προεπισκόπηση
es_es: Vista previa
fr_fr: Aperçu
hi_in: पूर्वावलोकन
it_it: Anteprima
ko_kr: 미리보기
pt_pt: Pré-visualização
ro_ro: Previzualizare
ru_ru: Просмотр
th_th: ตัวอย่าง
tr_tr: Önizleme
zh_cn: 预览
zh_hk: 預覽

source: Success!
da_dk: Succes!
de_de: Erfolg!
el_gr: Επιτυχία!
es_es: ¡Éxito!
fr_fr: Succès !
hi_in: सफलता!
it_it: Successo!
ko_kr: 성공!
pt_pt: Sucesso!
ro_ro: Succes!
ru_ru: Успех!
th_th: สำเร็จ!
tr_tr: Başarılı!
zh_cn: 成功！
zh_hk: 成功！

source: Mermaid to HTML Converter
da_dk: Mermaid til HTML-konverter
de_de: Mermaid-zu-HTML-Konverter
el_gr: Μετατροπέας Mermaid σε HTML
es_es: Conversor de Mermaid a HTML
fr_fr: Convertisseur Mermaid vers HTML
hi_in: मर्मैड से HTML कन्वर्टर
it_it: Convertitore da Mermaid a HTML
ko_kr: Mermaid에서 HTML로 변환기
pt_pt: Conversor de Mermaid para HTML
ro_ro: Convertor Mermaid în HTML
ru_ru: Конвертер Mermaid в HTML
th_th: ตัวแปลง Mermaid เป็น HTML
tr_tr: Mermaid'den HTML'e Dönüştürücü
zh_cn: Mermaid 转 HTML 转换器
zh_hk: Mermaid 轉 HTML 轉換器

source: Diagram updated successfully.
da_dk: Diagrammet blev opdateret.
de_de: Diagramm erfolgreich aktualisiert.
el_gr: Το διάγραμμα ενημερώθηκε με επιτυχία.
es_es: Diagrama actualizado correctamente.
fr_fr: Diagramme mis à jour avec succès.
hi_in: आरेख सफलतापूर्वक अद्यतन किया गया।
it_it: Diagramma aggiornato con successo.
ko_kr: 다이어그램이 성공적으로 업데이트되었습니다.
pt_pt: Diagrama atualizado com sucesso.
ro_ro: Diagrama a fost actualizată cu succes.
ru_ru: Диаграмма успешно обновлена.
th_th: อัปเดตไดอะแกรมสำเร็จแล้ว
tr_tr: Diyagram başarıyla güncellendi.
zh_cn: 图表更新成功。
zh_hk: 流程圖更新成功。

# Type your Mermaid here...
source: Enter your Mermaid code here...
da_dk: Skriv din Mermaid her...
de_de: Geben Sie hier Ihre Mermaid-Diagramm-Beschreibung ein...
el_gr: Πληκτρολογήστε τον κώδικά σας σε Mermaid εδώ...
es_es: Escribe tu Mermaid aquí...
fr_fr: Saisissez votre Mermaid ici...
hi_in: अपना Mermaid यहाँ टाइप करें...
it_it: Digita il tuo Mermaid qui...
ko_kr: Mermaid 코드를 여기에 입력하세요...
pt_pt: Escreva o seu Mermaid aqui...
ro_ro: Introduceți codul Mermaid aici...
ru_ru: Введите ваш Mermaid здесь...
th_th: พิมพ์ Mermaid ของคุณที่นี่...
tr_tr: Mermaid kodunuzu buraya yazın...
zh_cn: 在此输入您的 Mermaid 代码...
zh_hk: 在此輸入您的 Mermaid 代碼...

source: Type Mermaid on the left, see SVG preview on the right.
da_dk: Skriv Mermaid til venstre, se SVG-eksempel til højre.
de_de: Geben Sie Mermaid auf der linken Seite ein, sehen Sie die SVG-Vorschau auf der rechten Seite.
el_gr: Πληκτρολογήστε Mermaid στα αριστερά, δείτε την προεπισκόπηση SVG στα δεξιά.
es_es: Escriba Mermaid a la izquierda, vea la vista previa SVG a la derecha.
fr_fr: Saisissez Mermaid à gauche, voyez l'aperçu SVG à droite.
hi_in: बाईं ओर Mermaid टाइप करें, दाईं ओर SVG पूर्वावलोकन देखें।
it_it: Digita Mermaid a sinistra, vedi l'anteprima SVG a destra.
ko_kr: 왼쪽에 Mermaid를 입력하고 오른쪽에서 SVG 미리보기를 확인하세요.
pt_pt: Escreva Mermaid à esquerda, veja a pré-visualização SVG à direita.
ro_ro: Tastați Mermaid în stânga, vedeți previzualizarea SVG în dreapta.
ru_ru: Вводите Mermaid слева, смотрите SVG-превью справа.
th_th: พิมพ์ Mermaid ทางซ้าย ดูตัวอย่าง SVG ทางขวา
tr_tr: Solda Mermaid yazın, sağda SVG önizlemesini görün.
zh_cn: 在左侧输入 Mermaid 代码，右侧查看 SVG 预览。
zh_hk: 喺左邊輸入 Mermaid，右邊睇到 SVG 預覽。

source: Download SVG
da_dk: Hent SVG
de_de: SVG herunterladen
el_gr: Λήψη SVG
es_es: Descargar SVG
fr_fr: Télécharger le SVG
hi_in: SVG डाउनलोड करें
it_it: Scarica SVG
ko_kr: SVG 다운로드
pt_pt: Transferir SVG
ro_ro: Descarcă SVG
ru_ru: Скачать SVG
th_th: ดาวน์โหลด SVG
tr_tr: SVG İndir
zh_cn: 下载 SVG
zh_hk: 下載 SVG

source: Convert and save
da_dk: Konverter og gem
de_de: Konvertieren und speichern
el_gr: Μετατροπή και αποθήκευση
es_es: Convertir y guardar
fr_fr: Convertir et enregistrer
hi_in: कन्वर्ट करें और सहेजें
it_it: Converti e salva
ko_kr: 변환 후 저장
pt_pt: Converter e guardar
ro_ro: Convertează și salvează
ru_ru: Преобразовать и сохранить
th_th: แปลงและบันทึก
tr_tr: Dönüştür ve kaydet
zh_cn: 转换并保存
zh_hk: 轉換並儲存

source: Preview will appear here after conversion.
da_dk: Forhåndsvisning vil blive vist her efter konvertering.
de_de: Die Vorschau wird hier nach der Konvertierung erscheinen.
el_gr: Η προεπισκόπηση θα εμφανιστεί εδώ μετά τη μετατροπή.
es_es: La vista previa aparecerá aquí después de la conversión.
fr_fr: L'aperçu apparaîtra ici après la conversion.
hi_in: रूपांतरण के बाद यहां पूर्वावलोकन दिखाई देगा।
it_it: L'anteprima apparir√† qui dopo la conversione.
ko_kr: 변환 후 미리보기가 여기에 나타납니다.
pt_pt: A pré-visualização aparecerá aqui após a conversão.
ro_ro: Previzualizarea va apărea aici după conversie.
ru_ru: Здесь появится предварительный просмотр после преобразования.
th_th: ตัวอย่างจะปรากฏที่นี่หลังการแปลง
tr_tr: Önizleme dönüşümden sonra burada görünecek.
zh_cn: 转换后，预览将在此处显示。
zh_hk: 轉換後，預覽將在此處顯示。

# My Mermaid Charts
source: My Mermaid Diagrams
da_dk: Mine Mermaid-diagrammer
de_de: Meine Mermaid-Diagramme
el_gr: Τα Διαγράμματά Μου Mermaid
es_es: Mis Diagramas Mermaid
fr_fr: Mes diagrammes Mermaid
hi_in: मेरे मरमेड चार्ट्स
it_it: I miei diagrammi Mermaid
ko_kr: 내 Mermaid 차트
pt_pt: Os meus Gráficos Mermaid
ro_ro: Diagramele mele Mermaid
ru_ru: Мои диаграммы Mermaid
th_th: แผนภูมิ Mermaid ของฉัน
tr_tr: Mermaid Çizelgelerim
zh_cn: 我的 Mermaid 图表
zh_hk: 我的美人魚圖表

source: Convert to SVG
da_dk: Konverter til SVG
de_de: In SVG konvertieren
el_gr: Μετατροπή σε SVG
es_es: Convertir a SVG
fr_fr: Convertir en SVG
hi_in: SVG में बदलें
it_it: Converti in SVG
ko_kr: SVG로 변환
pt_pt: Converter para SVG
ro_ro: Convertește în SVG
ru_ru: Преобразовать в SVG
th_th: แปลงเป็น SVG
tr_tr: SVG'ye Dönüştür
zh_cn: 转换为SVG
zh_hk: 轉換為 SVG
