Repository: AiursoftWeb/MarkToHtml
Catalog: src/Aiursoft.MarkToHtml/Resources/Configuration/SettingsMap.*.resx
Languages: pl_pl, sv_se

source: Allow User Adjust Nickname
pl_pl: Zezwól użytkownikowi na zmianę pseudonimu
sv_se: Tillåt Användare Ändra Smeknamn

source: Allow users to adjust their nickname in the profile management page.
pl_pl: Zezwól użytkownikom na dostosowanie swojego pseudonimu na stronie zarządzania profilem.
sv_se: Tillåt användare att justera sin smeknamn på sidan för profilhantering.

source: Brand Home URL
pl_pl: Adres URL strony głównej marki
sv_se: Varumärkesstartsida URL

source: Brand Name
pl_pl: Nazwa marki
sv_se: Varumärke

source: Company Address
pl_pl: Adres firmy
sv_se: Företagets adress

source: Company Email
pl_pl: Adres e-mail firmy
sv_se: Företags e-post

source: Company Phone
pl_pl: Numer telefonu firmy
sv_se: Företagsnummer

source: Company Postcode
pl_pl: Kod pocztowy firmy
sv_se: Företagspostnummer

source: ICP Number
pl_pl: Numer ICP
sv_se: ICP-nummer

source: Project Logo
pl_pl: Logo projektu
sv_se: Projektlogotyp

source: Project Name
pl_pl: Nazwa projektu
sv_se: Projektnamn

source: The address of the company or project.
pl_pl: Adres firmy lub projektu.
sv_se: Adressen för företaget eller projektet.

source: The brand name of the company or project. E.g. Aiursoft.
pl_pl: Nazwa marki firmy lub projektu. Na przykład: Aiursoft.
sv_se: Det är varumärket för företaget eller projektet. Till exempel Aiursoft.

source: The email address of the company or project.
pl_pl: Adres e-mail firmy lub projektu.
sv_se: E-postadressen för företaget eller projektet.

source: The ICP license number for China mainland users. Leave empty to hide.
pl_pl: Numer licencji ICP dla użytkowników z Chin. Pozostaw puste, aby ukryć.
sv_se: ICP-licensnummer för användare i Kina. Lämna tomt för att dölja.

source: The logo of the project displayed in the navbar and footer. Support jpg, png, svg.
pl_pl: Logo projektu wyświetlany w pasku nawigacyjnym i stopce. Obsługiwane formaty: jpg, png, svg.
sv_se: Logotypen för projektet som visas i navigeringsfältet och sidfoten. Stöd för jpg, png, svg.

source: The name of the project displayed in the frontend.
pl_pl: Nazwa projektu wyświetlana w interfejsie użytkownika.
sv_se: Namnet på projektet som visas i användargränssnittet.

source: The phone number of the company or project.
pl_pl: Numer telefonu firmy lub projektu.
sv_se: Telefonnummer för företaget eller projektet.

source: The postcode of the company or project.
pl_pl: Kod pocztowy firmy lub projektu.
sv_se: Postkod för företaget eller projektet.

source: The URL of the company or project. E.g. https://www.aiursoft.com
pl_pl: Adres URL firmy lub projektu. Przykładowo: https://www.aiursoft.com
sv_se: URL:en för företaget eller projektet. Till exempel https://www.aiursoft.com
