Repository: AiursoftWeb/MarkToHtml
Catalog: src/Aiursoft.MarkToHtml/Resources/Views/Markdown/Index.*.resx
Languages: nl_nl

source: Success!
nl_nl: Gelukt!

source: Markdown Input
nl_nl: Markdown-invoer

source: Document updated successfully.
nl_nl: Document succesvol bijgewerkt.

source: Type your Markdown here...
nl_nl: Typ hier je Markdown...

source: Markdown to HTML Converter
nl_nl: Markdown naar HTML-converter

source: Document Title (optional)
nl_nl: Documenttitel (optioneel)

source: Copy
nl_nl: Kopiëren

source: A simple tool to convert your Markdown into clean, sanitized HTML.
nl_nl: Een eenvoudig hulpmiddel om uw Markdown om te zetten in schone, gesanitiseerde HTML.

source: Print Preview
nl_nl: Afdrukvoorbeeld

source: Copy HTML to clipboard
nl_nl: HTML naar klembord kopiëren

source: My Documents
nl_nl: Mijn documenten

source: Preview
nl_nl: Voorbeeld

source: Convert and save
nl_nl: Converteren en opslaan

source: Convert to HTML
nl_nl: Converteren naar HTML

source: Copied!
nl_nl: Gekopieerd!

source: HTML preview will appear here after conversion.
nl_nl: Hier verschijnt de HTML-voorbeeldweergave na conversie.

source: Print
nl_nl: Afdrukken

source: Failed to copy text.
nl_nl: Tekst kopiëren mislukt.
