Repository: AiursoftWeb/MarkToHtml
Catalog: src/Aiursoft.MarkToHtml/Resources/Views/Contract/Fill.*.resx
Languages: da_dk, el_gr, fr_fr, hi_in, sv_se, uk_ua, zh_hk

source: Address
da_dk: Adresse
el_gr: Διεύθυνση
fr_fr: Adresse
hi_in: पता
sv_se: Adress
uk_ua: Адреса
zh_hk: 地址

source: Authorized Representative Signature
da_dk: Godkendt repræsentant underskrift
el_gr: Υπογραφή Εξουσιοδοτημένου Αντιπροσώπου
fr_fr: Signature du représentant autorisé
hi_in: अधिकृत प्रतिनिधि हस्ताक्षर
sv_se: Godkänd representantens signatur
uk_ua: Підпис уповноваженого представника
zh_hk: 授權代表簽署

source: Back
da_dk: Tilbage
el_gr: Πίσω
fr_fr: Retour
hi_in: पीछे
sv_se: Tillbaka
uk_ua: Назад
zh_hk: 返回

source: Contact
da_dk: Kontakt
el_gr: Επαφή
hi_in: संपर्क
sv_se: Kontakt
uk_ua: Контакт
zh_hk: 聯絡人

source: Contract Information
da_dk: Kontraktinformation
el_gr: Πληροφορίες Συμβάσεως
fr_fr: Informations sur le contrat
hi_in: संविदा जानकारी
sv_se: Kontraktinformation
uk_ua: Інформація про договір
zh_hk: 合約資料

source: Contract Number
da_dk: Aftalenummer
el_gr: Αριθμός Σύμβασης
fr_fr: Numéro de contrat
hi_in: संविदा संख्या
sv_se: Kontraktens nummer
uk_ua: Номер договору
zh_hk: 合約編號

source: Date
da_dk: Dato
el_gr: Ημερομηνία
hi_in: तारीख
sv_se: Datum
uk_ua: Дата
zh_hk: 日期

source: Day
da_dk: Dag
el_gr: Ημέρα
fr_fr: Jour
hi_in: दिन
sv_se: Dag
uk_ua: День
zh_hk: 日

source: Fill in the contract details
da_dk: Udfyld kontraktoplysningerne
el_gr: Συμπληρώστε τα στοιχεία της σύμβασης
fr_fr: Remplissez les détails du contrat
hi_in: संविदा विवरण भरें
sv_se: Fyll i kontraktuppgifterna
uk_ua: Заповніть деталі договору
zh_hk: 填寫合約詳情

source: Generate Contract
da_dk: Generer kontrakt
el_gr: Δημιουργία Συμβάσεως
fr_fr: Générer le contrat
hi_in: कॉन्ट्रैक्ट जनरेट करें
sv_se: Skapa avtal
uk_ua: Створити договір
zh_hk: 產生合約

source: Month
da_dk: Måned
el_gr: Μήνας
fr_fr: Mois
hi_in: महीना
sv_se: Månad
uk_ua: Місяць
zh_hk: 月

source: Party A (Customer)
da_dk: Part A (Kunde)
el_gr: Μερίδιο Α (Πελάτης)
fr_fr: Partie A (Client)
hi_in: पार्टी ए (ग्राहक)
sv_se: Parti A (Kund)
uk_ua: Сторона А (клієнт)
zh_hk: 甲方（客戶）

source: Party A (Stamp)
da_dk: Parti A (Stempel)
el_gr: Μερίδα Α (Σφραγίδα)
fr_fr: Partie A (Timbre)
hi_in: पार्टी ए (स्टैम्प)
sv_se: Parti A (Stämpel)
uk_ua: Сторона А (Печать)
zh_hk: 甲方（蓋章）

source: Party B (Provider)
da_dk: Part B (Udbyder)
el_gr: Μερίδιο Β (Προμηθευτής)
fr_fr: Partie B (Fournisseur)
hi_in: पार्टी बी (प्रदाता)
sv_se: Parti B (Leverantör)
uk_ua: Сторона Б (Постачальник)
zh_hk: 乙方（供應商）

source: Party B (Stamp)
da_dk: Parti B (Stempel)
el_gr: Μερίδιο Β (Σφραγίδα)
fr_fr: Partie B (Timbre)
hi_in: पार्टी बी (स्टैम्प)
sv_se: Parti B (Stämpel)
uk_ua: Сторона Б (Печать)
zh_hk: 乙方（蓋章）

source: Print
da_dk: Udskriv
el_gr: Εκτύπωση
fr_fr: Imprimer
hi_in: प्रिंट
sv_se: Skriv ut
uk_ua: Друк
zh_hk: 列印

source: Signing Date
da_dk: Underskrivelsesdato
el_gr: Ημερομηνία Υπογραφής
fr_fr: Date de signature
hi_in: हस्ताक्षर तारीख
sv_se: Underskrivningsdatum
uk_ua: Дата підписання
zh_hk: 簽署日期

source: Signing Location
da_dk: Underskrivelsessted
el_gr: Τοποθεσία Υπογραφής
fr_fr: Lieu de signature
hi_in: हस्ताक्षर स्थान
sv_se: Underteckningsplats
uk_ua: Місце підписання
zh_hk: 簽署地點

source: Year
da_dk: År
el_gr: Έτος
fr_fr: Année
hi_in: वर्ष
sv_se: År
uk_ua: Рік
zh_hk: 年
